org/RforS-II-data.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-05 水 14:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>入門統計学 RforS データ処理 (データ解析)</title>
<meta name="author" content="suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師 鈴木正幸，非常勤講師" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">入門統計学 RforS データ処理 (データ解析)</h1>

<div id="outline-container-org77d017d" class="outline-2">
<h2 id="org77d017d">データフレームの扱い</h2>
<div class="outline-text-2" id="text-org77d017d">
<p>
<a href="file:///nas/home/masayuki/COMM/Lects/R/Rintro/Rintro-3.html">file:~/COMM/Lects/R/Rintro/Rintro-3.org</a>
</p>
</div>
</div>

<div id="outline-container-orgd89d563" class="outline-2">
<h2 id="orgd89d563">関連サイト</h2>
<div class="outline-text-2" id="text-orgd89d563">
<p>
<a href="http://www.cc.aoyama.ac.jp/~t41338/lecture/aoyama/stat2e/stat2e_top.html">社会統計演習</a> (青山)   ここに指導法データの csv ファイルがあります。
windows用，mac用がありますので，選んでダウンロードしてください。
</p>
</div>
</div>

<div id="outline-container-org40f6b03" class="outline-2">
<h2 id="org40f6b03">データの置き場</h2>
<div class="outline-text-2" id="text-org40f6b03">
<p>
この講義用フォルダの下の data/shidouhou.csv にしましょう。
</p>
</div>
</div>

<div id="outline-container-org07cf01f" class="outline-2">
<h2 id="org07cf01f">指導法データ (data.frame)</h2>
<div class="outline-text-2" id="text-org07cf01f">
<div class="org-src-container">
<pre class="src src-R">
     (&#25351;&#23566;&#27861;&#12487;&#12540;&#12479; <span style="color: #e5786d;">&lt;-</span> read.csv(<span style="color: #95e454;">"data/shidouhou.csv"</span>))
     class(&#25351;&#23566;&#27861;&#12487;&#12540;&#12479;)
     str(&#25351;&#23566;&#27861;&#12487;&#12540;&#12479;)

</pre>
</div>

<pre class="example" id="org3fa170a">
	SID   name sex math stat psych_test stat_test1 stat_test2 method
     1    1   大村  男 嫌い 好き         13          6         10      C
     2    2   本多  男 嫌い 好き         14         10         13      B
     3    3   川崎  男 好き 好き          7          6          8      B
     4    4   多村  男 好き 好き         12         10         15      A
     5    5   松中  男 嫌い 嫌い         10          5          8      B
     6    6 小久保  男 嫌い 嫌い          6          3          6      C
     7    7   柴原  男 嫌い 嫌い          8          5          9      A
     8    8   井手  男 嫌い 嫌い         15          9         10      D
     9    9   田上  男 嫌い 嫌い          4          3          7      D
     10  10   松田  男 好き 嫌い         14          3          3      D
     11  11   高谷  女 好き 好き          9         11         18      A
     12  12   杉内  女 嫌い 好き          6          6         14      A
     13  13   和田  女 好き 好き         10         11         18      A
     14  14   新垣  女 嫌い 嫌い         12          9         11      C
     15  15   大隣  女 嫌い 好き          5          7         12      B
     16  16   水田  女 好き 嫌い         12          5          5      D
     17  17   斉藤  女 嫌い 嫌い          8          8          7      C
     18  18   柳瀬  女 嫌い 嫌い          8          7         12      C
     19  19   佐藤  女 嫌い 嫌い         12          7          7      B
     20  20   馬原  女 嫌い 嫌い         15          9          7      D
     [1] "data.frame"
     'data.frame':	20 obs. of  9 variables:
      $ SID       : int  1 2 3 4 5 6 7 8 9 10 ...
      $ name      : Factor w/ 20 levels "井手","高谷",..: 14 18 12 13 6 5 4 1 16 7 ...
      $ sex       : Factor w/ 2 levels "女","男": 2 2 2 2 2 2 2 2 2 2 ...
      $ math      : Factor w/ 2 levels "嫌い","好き": 1 1 2 2 1 1 1 1 1 2 ...
      $ stat      : Factor w/ 2 levels "嫌い","好き": 2 2 2 2 1 1 1 1 1 1 ...
      $ psych_test: int  13 14 7 12 10 6 8 15 4 14 ...
      $ stat_test1: int  6 10 6 10 5 3 5 9 3 3 ...
      $ stat_test2: int  10 13 8 15 8 6 9 10 7 3 ...
      $ method    : Factor w/ 4 levels "A","B","C","D": 3 2 2 1 2 3 1 4 4 4 ...
</pre>

<div class="org-src-container">
<pre class="src src-R">
&#25968;&#23398;s <span style="color: #e5786d;">&lt;-</span> &#25351;&#23566;&#27861;&#12487;&#12540;&#12479;$math
&#32113;&#35336;s <span style="color: #e5786d;">&lt;-</span> &#25351;&#23566;&#27861;&#12487;&#12540;&#12479;$stat
&#24515;&#29702;&#23398;&#12486;&#12473;&#12488; <span style="color: #e5786d;">&lt;-</span> &#25351;&#23566;&#27861;&#12487;&#12540;&#12479;$psych_test
&#32113;&#35336;&#12486;&#12473;&#12488;1 <span style="color: #e5786d;">&lt;-</span> &#25351;&#23566;&#27861;&#12487;&#12540;&#12479;$stat_test1
&#32113;&#35336;&#12486;&#12473;&#12488;2 <span style="color: #e5786d;">&lt;-</span> &#25351;&#23566;&#27861;&#12487;&#12540;&#12479;$stat_test2

</pre>
</div>
</div>

<div id="outline-container-org8363ece" class="outline-3">
<h3 id="org8363ece">クロス集計表</h3>
<div class="outline-text-3" id="text-org8363ece">
<div class="org-src-container">
<pre class="src src-R">
     (&#12463;&#12525;&#12473;&#38598;&#35336;&#34920; <span style="color: #e5786d;">&lt;-</span> table(&#25968;&#23398;s, &#32113;&#35336;s))

     class(&#12463;&#12525;&#12473;&#38598;&#35336;&#34920;)
</pre>
</div>

<pre class="example">
      統計s
数学s 嫌い 好き
  嫌い   10    4
  好き    2    4
[1] "table"
</pre>


<div class="org-src-container">
<pre class="src src-R">colnames(&#12463;&#12525;&#12473;&#38598;&#35336;&#34920;)
rownames(&#12463;&#12525;&#12473;&#38598;&#35336;&#34920;)
</pre>
</div>

<pre class="example">
[1] "嫌い" "好き"
[1] "嫌い" "好き"
</pre>


<div class="org-src-container">
<pre class="src src-R">
addmargins(&#12463;&#12525;&#12473;&#38598;&#35336;&#34920;)

&#12463;&#12525;&#12473;&#38598;&#35336;&#34920;

</pre>
</div>

<pre class="example">
      統計s
数学s 嫌い 好き Sum
  嫌い   10    4  14
  好き    2    4   6
  Sum    12    8  20
      統計s
数学s 嫌い 好き
  嫌い   10    4
  好き    2    4
</pre>


<div class="org-src-container">
<pre class="src src-R">sum(&#12463;&#12525;&#12473;&#38598;&#35336;&#34920;[1,])
sum(&#12463;&#12525;&#12473;&#38598;&#35336;&#34920;[2,])

</pre>
</div>

<pre class="example">
[1] 14
[1] 6
</pre>


<div class="org-src-container">
<pre class="src src-R">sum(&#12463;&#12525;&#12473;&#38598;&#35336;&#34920;[,1])
sum(&#12463;&#12525;&#12473;&#38598;&#35336;&#34920;[,2])

</pre>
</div>

<pre class="example">
[1] 12
[1] 8
</pre>


<div class="org-src-container">
<pre class="src src-R">( total <span style="color: #e5786d;">&lt;-</span> sum(sum(&#12463;&#12525;&#12473;&#38598;&#35336;&#34920;[,1]),sum(&#12463;&#12525;&#12473;&#38598;&#35336;&#34920;[,2])) )

&#26399;&#24453;&#24230;&#25968;s <span style="color: #e5786d;">&lt;-</span> matrix(nrow=2, ncol=2)
<span style="color: #8ac6f2; font-weight: bold;">for</span>(i <span style="color: #8ac6f2; font-weight: bold;">in</span> 1:2) {
  sc <span style="color: #e5786d;">&lt;-</span> sum(&#12463;&#12525;&#12473;&#38598;&#35336;&#34920;[i,])
  <span style="color: #8ac6f2; font-weight: bold;">for</span>(j <span style="color: #8ac6f2; font-weight: bold;">in</span> 1:2) {
    sr <span style="color: #e5786d;">&lt;-</span> sum(&#12463;&#12525;&#12473;&#38598;&#35336;&#34920;[,j])
    &#26399;&#24453;&#24230;&#25968;s[i,j] <span style="color: #e5786d;">&lt;-</span> sc*sr/total
  }
}
&#26399;&#24453;&#24230;&#25968;s

</pre>
</div>

<pre class="example">
[1] 20
     [,1] [,2]
[1,]  8.4  5.6
[2,]  3.6  2.4
</pre>


<div class="org-src-container">
<pre class="src src-R">
&#35251;&#28204;&#24230;&#25968;s <span style="color: #e5786d;">&lt;-</span> &#12463;&#12525;&#12473;&#38598;&#35336;&#34920;

(chi2 <span style="color: #e5786d;">&lt;-</span> (&#35251;&#28204;&#24230;&#25968;s-&#26399;&#24453;&#24230;&#25968;s)^2/&#26399;&#24453;&#24230;&#25968;s)

sum(chi2)

</pre>
</div>

<pre class="example">
      統計s
数学s      嫌い      好き
  嫌い 0.3047619 0.4571429
  好き 0.7111111 1.0666667
[1] 2.539683
</pre>
</div>
</div>

<div id="outline-container-org1343291" class="outline-3">
<h3 id="org1343291">table と 行列</h3>
<div class="outline-text-3" id="text-org1343291">
<div class="org-src-container">
<pre class="src src-R">    (&#23653;&#20462;A <span style="color: #e5786d;">&lt;-</span> matrix(c(16,12,4,8),nrow=2,
                     dimnames=list(&#31995;=c(<span style="color: #95e454;">"&#25991;&#31995;"</span>, <span style="color: #95e454;">"&#29702;&#31995;"</span>),
                                   &#23653;&#20462;=c(<span style="color: #95e454;">"&#12375;&#12383;"</span>, <span style="color: #95e454;">"&#12375;&#12394;&#12356;"</span>))
    ))
</pre>
</div>

<pre class="example">
      履修
系    した しない
  文系   16      4
  理系   12      8
</pre>
</div>
</div>



<div id="outline-container-org34a6bf1" class="outline-3">
<h3 id="org34a6bf1">subset</h3>
<div class="outline-text-3" id="text-org34a6bf1">
<div class="org-src-container">
<pre class="src src-R">
subset(&#25351;&#23566;&#27861;&#12487;&#12540;&#12479;, sex==<span style="color: #95e454;">"&#30007;"</span>)$stat_test1
subset(&#25351;&#23566;&#27861;&#12487;&#12540;&#12479;, sex==<span style="color: #95e454;">"&#22899;"</span>)$stat_test1

</pre>
</div>

<pre class="example">
[1]  6 10  6 10  5  3  5  9  3  3
[1] 11  6 11  9  7  5  8  7  7  9
</pre>
</div>
</div>


<div id="outline-container-org5e3e3eb" class="outline-3">
<h3 id="org5e3e3eb">7章の一元</h3>
<div class="outline-text-3" id="text-org5e3e3eb">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #99968b;"># </span><span style="color: #99968b;">(&#32113;&#35336;2&#12392;&#25351;&#23566; &lt;- &#25351;&#23566;&#27861;&#12487;&#12540;&#12479;[c(8,9)])</span>
<span style="color: #99968b;"># </span><span style="color: #99968b;">(&#32113;&#35336;2&#12392;&#25351;&#23566; &lt;- &#25351;&#23566;&#27861;&#12487;&#12540;&#12479;[c("stat_test2","method")])</span>

(As <span style="color: #e5786d;">&lt;-</span> subset(&#25351;&#23566;&#27861;&#12487;&#12540;&#12479;, method==<span style="color: #95e454;">"A"</span>))
(As <span style="color: #e5786d;">&lt;-</span> subset(&#25351;&#23566;&#27861;&#12487;&#12540;&#12479;, method==<span style="color: #95e454;">"A"</span>))$stat_test2
(Bs <span style="color: #e5786d;">&lt;-</span> subset(&#25351;&#23566;&#27861;&#12487;&#12540;&#12479;, method==<span style="color: #95e454;">"B"</span>))$stat_test2
(Cs <span style="color: #e5786d;">&lt;-</span> subset(&#25351;&#23566;&#27861;&#12487;&#12540;&#12479;, method==<span style="color: #95e454;">"C"</span>))$stat_test2
(Ds <span style="color: #e5786d;">&lt;-</span> subset(&#25351;&#23566;&#27861;&#12487;&#12540;&#12479;, method==<span style="color: #95e454;">"D"</span>))$stat_test2


</pre>
</div>

<pre class="example" id="org94e8991">
   SID name sex math stat psych_test stat_test1 stat_test2 method
4    4 多村  男 好き 好き         12         10         15      A
7    7 柴原  男 嫌い 嫌い          8          5          9      A
11  11 高谷  女 好き 好き          9         11         18      A
12  12 杉内  女 嫌い 好き          6          6         14      A
13  13 和田  女 好き 好き         10         11         18      A
[1] 15  9 18 14 18
[1] 13  8  8 12  7
[1] 10  6 11  7 12
[1] 10  7  3  5  7
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: suzuki@iwate-u.ac.jp 鈴木正幸，非常勤講師 鈴木正幸，非常勤講師</p>
<p class="date">Created: 2022-01-05 水 14:30</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
